Repository: xvitaly/srcrepair
Catalog: docs/source/locale/*/LC_MESSAGES/config-editor.po
Languages: ru

source: Config editor
ru: Редактор файлов конфигурации игр

source: Game configuration file editor (config editor) allow you to easily create, view or edit any Source Engine game configs in a simple, but powerful GUI.
ru: Редактор файлов конфигурации (далее **конфигов**) позволяет легко и быстро просматривать, создавать и редактировать конфиги любых Source игр и серверов в графическом режиме. Редактор позволяет открывать и сохранять любые конфиги Source-игр через стандартное для Windows окно открытия/сохранения файлов.

source: Working with config editor
ru: Работа с редактором

source: In the first column **Variable** you must specify variable name (eg. ``cl_cmdrate``), and in the second **Value** -- its value (eg. ``66``). Value can be omitted.
ru: Работать с редактором очень просто. В первом столбце **Переменная** пишется имя переменной, например, ``cl_cmdrate``, а во втором **Значение переменной** -- её значение, например, ``66``. Поле значения может быть опущено.

source: Variable name must not contain any spaces, commentaries, etc. Value can be both double-quoted, or without them. If value contains spaces, double quotes are mandatory.
ru: Имя переменной не должно содержать пробелов, комментариев и т.д. Значение переменной можно писать как в кавычках, так и без них. Однако если оно содержит пробелы, то кавычки обязательны.

source: All commentaries are forbidden and will be removed on save/load procedures to reduce config file size and increase its loading speed.
ru: Комментарии в конфигах не допускаются и будут автоматически удалены для уменьшения размера конфига и увеличения скорости его загрузки игрой.

source: To add a new row, just start typing text in the last cell.
ru: Чтобы добавить новую строку просто начинайте набирать текст в последней пустой строке программы.

source: To remove currently selected row, press **Delete selected row** button on the main toolbar, or press **Delete** on keybooard. You can select and remove multiple rows at once.
ru: Чтобы удалить активную строку, нажмите кнопку **Удалить строку** на панели инструментов редактора или клавишу **Delete** на клавиатуре компьютера. Присутствует возможность удаления сразу нескольких строк. Для этого выделите их мышью, либо с помощью клавиатуры.

source: You can ask program to show hint. Select row and press **Show hint** button or press **F7** to show description of current variable. If no variables were found, an error message will be shown.
ru: При нажатии клавиши **F7** (или кнопки **Показать подсказку** на панели инструментов) в ячейке, содержащей имя переменной, будет выведено окно с русскоязычным описанием данной переменной. Если для переменной в нашей базе нет описания, будет выдано соответствующее сообщение с предложением добавить её в БД.

source: If you want to edit config as a text file, press **Open config in Notepad** button. File will be loaded by a :ref:`selected <settings-advanced>` (or system default) text editor.
ru: Кнопка **Редактировать файл в Блокноте** загрузит текущий конфиг в :ref:`выбранном текстовом редакторе <settings-advanced>` (или по умолчанию для текущей платформы).

source: Creating new configs
ru: Создание нового файла конфигурации игры

source: Press **Create a new config** button on the main toolbar.
ru: Нажмите на панели инструментов кнопку **Создать новый конфиг**.

source: Edit config as described in :ref:`working with config editor <editor-working>`.
ru: Начните заполнять таблицу как описано в :ref:`работа с редактором <editor-working>` выше.

source: Press **Save config** button on the main toolbar to save changes in config file. If it was a new file, save as dialog will be shown. Extension is not required.
ru: Закончив редактирование, нажмите кнопку **Сохранить изменения в файл** на панели инструментов. Если файл ранее не сохранялся, то у вас будет запрошено имя файла (расширение вводить не обязательно).

source: Loading config file
ru: Открытие существующего файла конфигурации игры

source: Press **Open config from file** button on the main toolbar and select file on disk with standard open file dialog (depends on platform).
ru: Нажмите кнопку **Открыть конфиг из файла** на панели инструментов и выберите файл для редактирования. Окно открытия файла стандартно для используемой платформы, поэтому не должно вызывать вопросов.

source: Press **Save config** button on the main toolbar to save changes in config file.
ru: Нажмите **Сохранить изменения в файл** на панели инструментов для сохранения его на диске.

source: If safe clean is enabled (green light in status bar), backup file will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включён режим безопасной работы (горит зелёный индикатор в строке состояния), будет автоматически создана резервная копия файла. Восстановить или удалить её можно на странице :ref:`Резервные копии <backups-about>`.

source: Other useful information
ru: Прочая полезная информация о редакторе

source: If you :ref:`create a new <editor-createcfg>` or :ref:`load config <editor-loadcfg>`, all existing contents of editor will be removed. Save it before performing this actions.
ru: При нажатии кнопки :ref:`Создать новый конфиг <editor-createcfg>`, либо :ref:`Открыть конфиг из файла <editor-loadcfg>` текущее содержимое редактора будет безвозвратно утеряно, поэтому убедитесь, что вы сохранили изменения перед созданием нового, либо открытием существующего файла.

source: If you want to close current config file and free its resources, just open another one or press **Create a new config** button.
ru: Чтобы закрыть файл и освободить его ресурсы, просто откройте другой, либо нажмите кнопку **Создать новый конфиг**.
