Repository: xvitaly/srcrepair
Catalog: docs/source/locale/*/LC_MESSAGES/development.po
Languages: ru

source: Development
ru: Разработка

source: Building from sources
ru: Сборка из исходников

source: There are two supported ways to build application from sources:
ru: Существует два поддерживаемых способа сборки программы из исходников:

source: fully automatic build;
ru: полностью автоматический;

source: manual build.
ru: ручной.

source: Preparing to build
ru: Подготовка к сборке

source: Clone this repository or download a source tarball from `releases page <https://github.com/xvitaly/srcrepair/releases>`_.
ru: Клонируйте репозиторий с исходными кодами программы при помощи Git клиента, либо скачайте архив из `архива релизов <https://github.com/xvitaly/srcrepair/releases>`_.

source: Install pre-requirements.
ru: Установите дополнительные компоненты, необходимые для сборки (зависимости).

source: Installing pre-requirements
ru: Установка зависимостей

source: First you will need to install C# complier, Microsoft .NET Framework SDK and other required tools (all steps are mandatory):
ru: Сначала потребуется установить компилятор языка программирования C#, комплект разработчика Microsoft .NET Framework и другие важные программные компоненты (все шаги являются обязательными):

source: download `Microsoft Visual Studio 2019 Community <https://visualstudio.microsoft.com/vs/community/>`_ installer and run it;
ru: скачайте программу установки `Microsoft Visual Studio 2019 Community <https://visualstudio.microsoft.com/vs/community/>`_ и запустите её;

source: select **Microsoft Visual Studio 2019 Community**, enable **Classic .NET application development** component, then switch to **Additional components** tab and enable **NuGet package manager**;
ru: выберите **Microsoft Visual Studio 2019 Community**, установите флажок около компонента **Разработка классических приложений .NET**, перейдите на страницу **Дополнительные компоненты** и отметьте флажком **Пакетный менеджер NuGet**;

source: install Microsoft Visual Studio 2019 Community;
ru: установите Microsoft Visual Studio 2019 Community;

source: download the latest version of `NuGet CLI <https://www.nuget.org/downloads>`_ and copy executable to any directory, located in ``%PATH%`` environment variable;
ru: скачайте самую свежую версию `утилиты NuGet <https://www.nuget.org/downloads>`_ и скопируйте EXE-файл в любой каталог, указанный внутри переменной окружения ``%PATH%``;

source: install `Doxygen for Windows <http://www.doxygen.nl/download.html>`_ to a default directory;
ru: установите `Doxygen для Windows <http://www.doxygen.nl/download.html>`_ в каталог по умолчанию;

source: download and install `HTML Help Workshop <https://www.microsoft.com/en-us/download/details.aspx?id=21138>`_;
ru: скачайте и установите `HTML Help Workshop <https://www.microsoft.com/en-us/download/details.aspx?id=21138>`_;

source: download and install `Gpg4Win <https://www.gpg4win.org/>`_ to a default directory;
ru: скачайте и установите `Gpg4Win <https://www.gpg4win.org/>`_ в каталог по умолчанию;

source: download and install `Python 3.7 for Windows <https://www.python.org/downloads/windows/>`_;
ru: скачайте и установите `Python 3.7 для Windows <https://www.python.org/downloads/windows/>`_;

source: open terminal and install Sphinx-doc using PIP: ``pip3 install sphinx``;
ru: откройте окно командной строки и установите Sphinx-doc при помощи пакетного менеджера Python -- PIP: ``pip3 install sphinx``;

source: download and install `7-Zip for Windows <https://www.7-zip.org/download.html>`_ to a default directory;
ru: скачайте и установите `7-Zip для Windows <https://www.7-zip.org/download.html>`_ в каталог по умолчанию;

source: download and install `InnoSetup 6 <http://www.jrsoftware.org/isdl.php>`_ to a default directory.
ru: скачайте и установите `InnoSetup 6 <http://www.jrsoftware.org/isdl.php>`_ в каталог по умолчанию.

source: Automatic build
ru: Автоматическая сборка

source: If you want to use automatic build, follow this steps:
ru: Если вы хотите использовать автоматическую сборку, просто выполните следующие действия:

source: install pre-requirements;
ru: установите все указанные выше зависимости;

source: double click on ``packaging/build_win.cmd``.
ru: дважды кликните в Проводнике Windows по файлу ``packaging/build_win.cmd``.

source: You will find results in a ``packaging/results`` directory.
ru: Результат сборки можно найти в каталоге ``packaging/results``.

source: Manual build
ru: Ручная сборка

source: If you don't want to use automatic method, you can build this project manually.
ru: Если вы не желаете использовать автоматическую сборку, можно выполнить всё вручную.

source: Building main project
ru: Сборка основного проекта

source: Start Microsoft Visual Studio 2019 Community.
ru: Запустите интегрированную среду разработки Microsoft Visual Studio 2019 Community.

source: **File** -- **Open** -- **Project or solution**, select ``srcrepair.sln``, then press **Open** button.
ru: **Файл** -- **Открыть** -- **Проект или решение**, выберите ``srcrepair.sln``, затем нажмите кнопку **Открыть**.

source: **Tools** -- **NuGet Package Manager** -- **Manage NuGet packages for Solution**, press **Restore** button.
ru: **Инструменты** -- **Пакетный менеджер NuGet** -- **Управление пакетами NuGet для решения**, нажмите кнопку **Восстановить**.

source: **Build** -- **Configuration manager** -- **Active solution configuration** -- **Release**, then press **Close** button.
ru: **Построение** -- **Менеджер конфигураций** -- **Активная конфигурация** -- **Release**, затем нажмите кнопку **Закрыть**.

source: **Build** -- **Build solution**.
ru: **Построение** -- **Построить решение**.

source: You will find results in a ``srcrepair/bin/Release`` directory.
ru: Результат сборки можно найти в каталоге ``srcrepair/bin/Release``.

source: Building installer
ru: Сборка программы установки

source: Run InnoSetup Compiler.
ru: Запустите InnoSetup Compiler.

source: Open file ``packaging/inno/srcrepair.iss``.
ru: Откройте файл ``packaging/inno/srcrepair.iss``.

source: **Build** -- **Compile**.
ru: Выберите **Build** -- **Compile**.

source: If InnoSetup will complain about missing ``*.sig`` files, you will need to manually sign (use detached signatures) compiled binaries with GnuPG by using Gpg4Win, or remove this rows from InnoSetup script.
ru: Если компилятор InnoSetup будет жаловаться на отсутствие ``*.sig`` файлов, вам придётся самостоятельно подписать при помощи GnuPG (входит в набор Gpg4Win) собранные исполняемые файлы (используйте только отсоединённые подписи), либо просто удалить данные строки из сборочного скрипта.

source: Cleanup database documentation
ru: Документация базы очистки

source: The original source file is located in ``assets/cleanup.xml``.
ru: Исходный файл ``assets/cleanup.xml``.

source: XML database example
ru: Пример базы данных в формате XML

source: Properties
ru: Доступные свойства

source: Level 0:
ru: Уровень 0:

source: ``Targets`` -- XML root element.
ru: ``Targets`` -- корневой элемент XML.

source: Level 1:
ru: Уровень 1:

source: ``Target`` -- database entry base element.
ru: ``Target`` -- базовый элемент.

source: Level 2:
ru: Уровень 2:

source: ``ID`` -- unique identifier (integer, starting from ``1``);
ru: ``ID`` -- уникальный идентификатор (целое число, начинающееся с ``1``);

source: ``Name`` -- user-friendly name;
ru: ``Name`` -- понятное конечному пользователю название;

source: ``Directories`` -- list of directories for cleanup.
ru: ``Directories`` -- список каталогов для очистки.

source: Level 3:
ru: Уровень 3:

source: ``Directory`` -- path to a single directory (with templates support):
ru: ``Directory`` -- содержит путь к каталогу для очистки с поддержкой шаблонов и подстановок:

source: ``Safe`` -- this directory can be safely cleaned;
ru: ``Safe`` -- эта директория не содержит важных файлов и может быть безопасно очищена;

source: ``Unsafe`` -- cleaning up this directory may be dangerous (can be allowed in settings).
ru: ``Unsafe`` -- очистка этого каталога может быть небезопасной (может быть разрешено в настройках).

source: Directories
ru: Каталоги для очистки

source: Each path must ends with a file mask. All matched files will be marked to deletion.
ru: Каждый путь должен в обязательном порядке заканчиваться маской файлов. Все файлы, удовлетворяющие данной маске, будут помечены на удаление.

source: Use ``*.*`` to mark all files in a specified directory.
ru: Используйте символ подстановки ``*.*``, чтобы пометить все файлы в указанном каталоге.

source: Templates
ru: Шаблоны и подстановки

source: Available templates (can be used within the ``Directory`` property):
ru: Доступны следующие шаблоны и подстановки (могут использоваться внутри свойства ``Directory``):

source: ``$GamePath$`` -- will be replaced by the ``SelectedGame.GamePath``;
ru: ``$GamePath$`` -- будет заменено на ``SelectedGame.GamePath``;

source: ``$FullGamePath$`` -- will be replaced by the ``SelectedGame.FullGamePath``;
ru: ``$FullGamePath$`` -- будет заменено на ``SelectedGame.FullGamePath``;

source: ``$AppWorkshopDir$`` -- will be replaced by the ``SelectedGame.AppWorkshopDir``;
ru: ``$AppWorkshopDir$`` -- будет заменено на ``SelectedGame.AppWorkshopDir``;

source: ``$CloudScreenshotsPath$`` -- will be replaced by the ``SelectedGame.CloudScreenshotsPath``;
ru: ``$CloudScreenshotsPath$`` -- будет заменено на ``SelectedGame.CloudScreenshotsPath``;

source: ``\`` -- will be replaced by the correct trailing path directory separator character, depending on running platform.
ru: ``\`` -- будет заменён на корректный разделитель частей пути каталогов в зависимости от текущей платформы, на которой выполняется программа.

source: Multiple templates are supported in a single entry.
ru: Внутри одной строки разрешается использовать сразу несколько шаблонов или подстановок.

source: FPS-configs database documentation
ru: Документация базы FPS-конфигов

source: The original source file is located in ``assets/configs.xml``.
ru: Исходный файл ``assets/configs.xml``.

source: ``Configs`` -- XML root element.
ru: ``Configs`` -- корневой элемент XML.

source: ``Config`` -- database entry base element.
ru: ``Config`` -- базовый элемент.

source: ``Name`` -- FPS-config user-friendly name;
ru: ``Name`` -- понятное конечному пользователю название;

source: ``URI`` -- fully-qualified Zip archive download URL (safe redirects (3XX HTTP codes) are allowed);
ru: ``URI`` -- адрес Zip-архива для загрузки (редиректы с кодами 3XX разрешены);

source: ``Mirror`` -- fully-qualified Zip archive download mirror URL (safe redirects (3XX HTTP codes) are allowed);
ru: ``Mirror`` -- адрес зеркала с Zip-архивом для загрузки (редиректы с кодами 3XX разрешены);

source: ``SupportedGames`` -- the list of supported game IDs, separated by commas;
ru: ``SupportedGames`` -- список поддерживаемых ID игр, разделённый запятыми;

source: ``ru`` -- user-friendly description in Russian (CDATA escaping is required);
ru: ``ru`` -- понятное конечному пользователю описание на русском языке (внутри тега необходимо использовать экранирование при помощи CDATA);

source: ``en`` -- user-friendly description in English (CDATA escaping is required);
ru: ``en`` -- понятное конечному пользователю описание на английском языке (внутри тега необходимо использовать экранирование при помощи CDATA);

source: ``ArchiveDir`` -- directory name in the archive (subdirectories are supported (use ``/`` symbol));
ru: ``ArchiveDir`` -- имя каталога внутри архива (подкаталоги также поддерживаются (используйте символ ``/`` в качестве разделителя));

source: ``InstallDir`` -- installation directory name;
ru: ``InstallDir`` -- каталог назначения;

source: ``Hash2`` -- download file SHA2 (SHA-512) hash, speficied in the ``URI``.
ru: ``Hash2`` -- SHA2 (SHA-512) хеш загрузки, указанной в ``URI``.

source: Games database documentation
ru: Документация базы игр

source: The original source file is located in ``assets/games.xml``.
ru: Исходный файл ``assets/games.xml``.

source: ``Games`` -- XML root element.
ru: ``Games`` -- корневой элемент XML.

source: ``Game`` -- database entry base element:
ru: ``Game`` -- базовый элемент:

source: ``Name`` -- user-friendly game name.
ru: ``Name`` -- понятное конечному пользователю название.

source: ``Enabled`` -- ``1`` if the current game is enabled or ``0`` -- if don't;
ru: ``Enabled`` -- ``1`` если игра разрешена для отображения, либо ``0`` если запрещена;

source: ``DirName`` -- game installation directory in ``SteamApps/common``;
ru: ``DirName`` -- имя каталога игры в ``SteamApps/common``;

source: ``SmallName`` -- game subdirectory name in ``SteamApps/common/$DirName``;
ru: ``SmallName`` -- имя собственного подкаталога игры в ``SteamApps/common/$DirName``;

source: ``VFDir`` -- directory (or registry key) name of video settings storage;
ru: ``VFDir`` -- имя каталога (или ключа реестра), в котором хранятся графические настройки игры;

source: ``UserDir`` -- ``1`` if the current game support custom user stuff, located in ``custom`` directory or ``0`` -- if don't;
ru: ``UserDir`` -- ``1`` если игра поддерживает пользовательский контент в виде каталога ``custom``, либо ``0`` если не поддерживает;

source: ``HUDsAvail`` -- ``1`` if the current game support custom HUDs or ``0`` -- if don't;
ru: ``HUDsAvail`` -- ``1`` если игра поддерживает нестандартные HUD, либо ``0`` если не поддерживает;

source: ``SID`` -- Steam database internal ID for the current game;
ru: ``SID`` -- внутренний ID игры в базе Steam;

source: ``SVer`` -- Source Engine version:
ru: ``SVer`` -- версия и тип движка Source:

source: ``1`` -- Source Engine 1, Type 1 (use Windows registry to store video settings);
ru: ``1`` -- Source Engine версии 1, тип 1 (использует системный реестр Windows для хранения графических настроек игры);

source: ``2`` -- Source Engine 1, Type 2 (use ``video.txt`` file to store video settings);
ru: ``2`` -- Source Engine версии 1, тип 2 (использует файл ``video.txt`` для хранения графических настроек игры);

source: ``3`` -- Source Engine 2, generic (not yet implemented; reserved for future use);
ru: ``3`` -- Source Engine версии 2, базовый тип (не реализовано в настоящее время; зарезервировано для использования в будущем);

source: ``4`` -- Source Engine 1, Type 4 (same as Type 1, but store video settings in ``videoconfig.cfg`` file);
ru: ``4`` -- Source Engine версии 1, тип 4 (то же, что и тип 1, но графические настройки игры сохраняются в файле ``videoconfig.cfg``);

source: ``Executable`` -- game executable file name (only for Windows).
ru: ``Executable`` -- имя исполняемого файла игры (используется только версией для Windows).

source: HUDs database documentation
ru: Документация базы HUD

source: The original source file is located in ``assets/huds.xml``.
ru: Исходный файл ``assets/huds.xml``.

source: ``HUDs`` -- XML root element.
ru: ``HUDs`` -- корневой элемент XML.

source: ``HUD`` -- database entry base element.
ru: ``HUD`` -- базовый элемент.

source: ``Name`` -- HUD user-friendly name;
ru: ``Name`` -- понятное конечному пользователю название;

source: ``Game`` -- short name of the supported by this HUD game (``SmallName`` from :ref:`games database <games-database>`);
ru: ``Game`` -- короткое имя поддерживаемой данным HUD игры (значение ``SmallName`` из :ref:`базы игр <games-database>`);

source: ``IsUpdated`` -- ``1`` if HUD supports the latest version of the game, ``0`` -- if don't;
ru: ``IsUpdated`` -- ``1`` если HUD поддерживает новейшие версии игры, либо ``0`` если не поддерживает;

source: ``UpURI`` -- upstream download archive URL (safe redirects (3XX HTTP codes) are allowed);
ru: ``UpURI`` -- адрес Zip-архива для загрузки (редиректы с кодом 3XX разрешены);

source: ``Preview`` -- screenshot of the game with this HUD or any custom image (JPEG and PNG formats are supported);
ru: ``Preview`` -- прямая ссылка на файл со скриншотом игры с данным HUD, либо любое другое изображение (поддерживаются форматы JPEG и PNG);

source: ``RepoPath`` -- GitHub repository URL or ``null``;
ru: ``RepoPath`` -- ссылка на GitHub-репозиторий, либо ``null``;

source: ``Hash2`` -- download file SHA2 (SHA-512) hash, speficied in the ``URI``;
ru: ``Hash2`` -- SHA2 (SHA-512) хеш загрузки, указанной в ``URI``;

source: ``LastUpdate`` -- HUD last update time in Unix timestamp format;
ru: ``LastUpdate`` -- дата последнего обновления HUD в формате UnixTime;

source: ``Site`` -- website or homepage URL;
ru: ``Site`` -- адрес домашней страницы;

source: ``InstallDir`` -- installation directory name.
ru: ``InstallDir`` -- каталог назначения.

source: Updates database documentation
ru: Документация базы обновлений

source: The original source file is located in ``assets/updates.xml``.
ru: Исходный файл ``assets/updates.xml``.

source: ``Updates`` -- XML root element.
ru: ``Updates`` -- корневой элемент XML.

source: ``Application`` -- sub-element with application update metadata;
ru: ``Application`` -- содержит метаданные обновления приложения;

source: ``GameDB`` -- sub-element with :ref:`games database <games-database>` update metadata;
ru: ``GameDB`` -- содержит метаданные обновления :ref:`базы игр <games-database>`;

source: ``HUDDB`` -- sub-element with :ref:`HUDs database <huds-database>` update metadata;
ru: ``HUDDB`` -- содержит метаданные обновления :ref:`базы HUD <huds-database>`;

source: ``CfgDB`` -- sub-element with :ref:`configs database <configs-database>` update metadata;
ru: ``CfgDB`` -- содержит метаданные обновления :ref:`базы FPS-конфигов <configs-database>`;

source: ``ClnDB`` -- sub-element with :ref:`cleanup database <cleanup-database>` update metadata.
ru: ``ClnDB`` -- содержит метаданные обновления :ref:`базы очистки <cleanup-database>`.

source: ``Version`` -- application or database version;
ru: ``Version`` -- версия приложения или базы данных;

source: ``URL`` -- direct download URL (no redirects are allowed);
ru: ``URL`` -- URL для загрузки (любые редиректы запрещены);

source: ``Hash2`` -- download file SHA2 (SHA-512) hash.
ru: ``Hash2`` -- SHA2 (SHA-512) хеш файла файла обновления.

source: Plugins database documentation
ru: Документация базы внешних модулей

source: The original source file is located in ``assets/plugins.xml``.
ru: Исходный файл ``assets/plugins.xml``.

source: ``Plugins`` -- XML root element.
ru: ``Plugins`` -- корневой элемент XML.

source: ``Plugin`` -- database entry base element.
ru: ``Plugin`` -- базовый элемент.

source: ``Name`` -- plugin user-friendly name;
ru: ``Name`` -- понятное конечному пользователю название;

source: ``IntName`` -- internal name for different actions;
ru: ``IntName`` -- внутреннее имя внешнего модуля для различных целей;

source: ``ExeName`` -- executable file name;
ru: ``ExeName`` -- имя исполняемого файла;

source: ``ElevationRequired`` -- ``1`` if the plugin need a local administrator rights in order to run, ``0`` -- if don't.
ru: ``ElevationRequired`` -- ``1`` если для запуска внешнего модуля требуется повышение прав до локального администратора, ``0`` -- если в дополнительных правах нет необходимости.
