Repository: xvitaly/srcrepair
Catalog: docs/source/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Frequently asked questions (FAQ)
ru: Часто задаваемые вопросы (ЧаВо)

source: How to fix an error with Microsoft .NET Framework 4 on program startup?
ru: При попытке запуска программы появляется сообщение об ошибке Microsoft .NET Framework 4. Что делать?

source: You to download and install Microsoft .NET Framework version 4.7.2 or higher in order to use this program.
ru: Для работы программы необходим установленный пакет Microsoft .NET Framework версии 4.7.2 или выше.

source: You can download if from official `Microsoft Download website <https://www.microsoft.com/net/download/dotnet-framework-runtime>`__.
ru: Скачайте и установите его с `официального сайта Microsoft <https://www.microsoft.com/net/download/dotnet-framework-runtime>`__.

source: How can I run this program under Windows XP/Vista?
ru: Как я могу запустить программу под Windows XP/Vista?

source: These legacy operating systems are no longer supported.
ru: Поддержка устаревших операционных систем полностью прекращена.

source: How to fix slow startup?
ru: Как ускорить запуск программы?

source: You can install SRC Repair for all users. Installer will use NGen to generate native images, which should significantly increate cold startup speed.
ru: Для ускорения запуска программы установите её с правами администратора для всех пользователей. При такой установке будут автоматически созданы машинные сборки, что значительно ускорит холодный старт приложения.

source: Can I use this program with cracked version of game?
ru: Будет ли программа поддерживать пиратские версии игр?

source: No. We support only legal Steam versions.
ru: Нет, не будет. Мы за лицензионный софт.

source: Will the Source 2 engine be supported and when?
ru: Будет ли поддержка игр на движке Source 2 и когда?

source: Maybe, but no ETA yet.
ru: Да, планируется, но точная дата неизвестна.

source: Is Dota 2 supported?
ru: Почему не поддерживается Dota 2?

source: This game uses the Source 2 engine, which is not supported yet.
ru: Данная игра использует движок Source 2, который в настоящее время не поддерживается.

source: Can this program steal my Steam account?
ru: Может ли программа украсть мой Steam аккаунт?

source: No. SRC Repair is a free and opensource program. You can check its `source code on GitHub <https://github.com/xvitaly/srcrepair>`__.
ru: Нет, не может. Вся функциональность программы документирована, а `исходный код открыт <https://github.com/xvitaly/srcrepair>`__ на GitHub для всех желающих.

source: Is it safe to run this program with Steam simultaneously?
ru: Безопасно ли запускать программу одновременно со Steam?

source: Yes, unless you use :ref:`Steam cleanup module <modules-stmcln>`.
ru: Да, если не выполнять :ref:`очистку кэшей Steam <modules-stmcln>`.

source: Is it safe to run this program with controlled game simultaneously?
ru: Безопасно ли использовать программу при запущенной игре, которой я управляю?

source: We strongly do not recommend doing this, as neither SRC Repair, nor the controled game cannot get exclusive access to files and settings.
ru: Настоятельно не рекомендуется, т.к. не гарантируется монопольный доступ к настройкам и файлам конфигурации.

source: Can I get VAC ban for using this program?
ru: Могут ли выдать VAC бан за использование программы?

source: No, but do not use this program with any running VAC-protected game.
ru: Нет, но постарайтесь не использовать SRC Repair одновременно с любой защищённой VAC игрой.

source: How I can report bug or create a new feature request?
ru: Куда направлять предложения/замечания по поводу программы?

source: Please open a new issue in our `bug tracker <https://github.com/xvitaly/srcrepair/issues>`__ on GitHub.
ru: Пожалуйста откройте новую заявку в нашей `системе отслеживания ошибок <https://github.com/xvitaly/srcrepair/issues>`__ на GitHub.

source: For what purposes does SRC Repair require Internet access?
ru: Мой файрвол (брандмауэр) заявляет, что SRC Repair хочет получить доступ к сети Интернет. Зачем?

source: SRC Repair need Internet access for checking for updates once a week (can be disabled in :ref:`advanced settings <settings-advanced>`).
ru: Работает модуль автоматического обновления программы. Раз в неделю он проверяет наличие новых версий на нашем сервере. Если вы не хотите, чтобы программа проверяла обновления, отключите эту функцию :ref:`дополнительных настройках <settings-advanced>`.

source: I want to add a new game. What should I do?
ru: Я хочу добавить поддержку новой игры. Как это сделать?

source: We support only Source Engine games.
ru: Помните, что SRC Repair поддерживает только игры на движке Source.

source: Can I build SRC Repair from sources?
ru: Могу ли я собрать программу из исходников?

source: :ref:`Yes, you can <building-from-sources>`.
ru: :ref:`Да, можете <building-from-sources>`.

source: How I can remove garbage, accumulated by installed games?
ru: Умеет ли данная программа очищать мусор, остающийся на диске в результате использования игр на движке Source?

source: Please use tools from :ref:`Troubleshooting and cleanup <cleanup-wizard>` tab.
ru: Да, умеет. Инструменты вы найдёте на странице :ref:`Устранение проблем и очистка <cleanup-wizard>`.

source: How I can remove garbage, accumulated by Steam?
ru: Умеет ли данная программа очищать мусор, остающийся на диске в результате использования клиента Steam?

source: Please use :ref:`Steam cleanup module <modules-stmcln>`.
ru: Да. Всё необходимое находится в меню **Инструменты** -- :ref:`Модуль очистки кэшей Steam <modules-stmcln>`.

source: I want to change installation directory, but cannot do this due to an error. What shall I do?
ru: Хочу установить программу в особый каталог, но при запуске установки появляется ошибка. Как исправить?

source: If you want to install program to a privileged directory, you will need to run installer with admininstrator user rights.
ru: Чтобы установить программу в привилегированный каталог, установщик должен быть запущен с правами администратора.

source: Press right mouse button on installer and select **Run as admininstrator** from context menu.
ru: Нажмите правой кнопкой по установщику и выберите пункт **Запуск от имени администратора** из контекстного меню.

source: How I can fix "Could not open registry key" error?
ru: При выборе игры появляется ошибка "Произошла ошибка при открытие ключа реестра". Что делать?

source: Please start selected game at least once from Steam, then restart SRC Repair.
ru: Для начала запустите данную игру из Steam хотя бы один раз, затем перезапустите SRC Repair.

source: If that does not help, you have ``-autoconfig`` or ``-dxlevel`` :ref:`command-line options <gt-params>` enabled.
ru: Если это не помогает, то скорее всего у вас включён :ref:`параметр запуска <gt-params>` ``-autoconfig`` или ``-dxlevel``.

source: Open command-line :ref:`options editor <gt-setparams>`, remove everything from this row, then launch the game.
ru: Откройте :ref:`окно изменения <gt-setparams>` параметров запуска и сотрите всё из данной строки, запустите игру, затем выйдите из неё.

source: Now SRC Repair will load video settings corretly.
ru: Теперь SRC Repair сможет управлять настройками графики.

source: Game do not respect settings set in graphic tweaker. How I can fix this?
ru: Игра перестала подчиняться заданным настройкам графики. Как это исправить?

source: This is a known issue for all Source Engine games if ``-dxlevel`` :ref:`command-line option <gt-params>` is set.
ru: Это очень старый баг всех игр на движке Source, который провляется если задан параметр запуска ``-dxlevel``. Откройте :ref:`окно изменения <gt-setparams>` параметров запуска и сотрите всё из данной строки. При следующем запуске игра будет использовать правильные настройки графики.

source: Garry's Mod cannot use DirectX 8.x mode. How can I fix this?
ru: Garry's Mod не использует режим DirectX 8.x после его установки в SRC Repair. Что делать?

source: DirectX 8.x support was removed from the latest Garry's Mod versions. This game will always use DirectX 9.0c, regardless of the selected mode in :ref:`graphic tweaker <gt-type1>`.
ru: В одном из последних обновлений разработчики данной игры вырезали поддержку DirectX 8.0 и 8.1, поэтому вне зависимости от выбранных опций рендеринга в модуле :ref:`графических настроек <gt-type1>`, игра всё равно будет использовать 9.0c.

source: Missing eyes after installing FPS-config in Team Fortress 2. How can I fix this?
ru: После установки FPS-конфига у персонажей в игре Team Fortress 2 нет глаз. Что делать?

source: Most of FPS-configs disable face animations in order to significantly increase game performance.
ru: Лицевая анимация потребляет очень много ресурсов, поэтому все FPS конфиги её полностью отключают.

source: All FPS-configs are licensed "as is". We cannot change them.
ru: Все FPS-конфиги в SRC Repair поставляются по лицензии "как есть", т.е. мы не имеем права вносить в них каких-либо изменений.

source: You can enable face animations by switching from ``r_eyes 0`` to ``r_eyes 1``.
ru: Снова включить лицевую анимацию можно если изменить значение ``r_eyes 0`` на ``r_eyes 1``.

source: How I can edit installed FPS-config?
ru: Как мне отредактировать установленный FPS-конфиг?

source: If you have installed :ref:`FPS-config <fps-about>`, you will see a yellow exclamation mark in :ref:`Graphic tweaker <graphic-tweaker>` tab.
ru: Если у вас установлен :ref:`FPS-config <fps-about>`, в левом нижнем углу страницы :ref:`Графические настройки <graphic-tweaker>` будет отображаться жёлтый восклицательный знак.

source: Press left mouse button on it and select FPS-config to edit by :ref:`Config editor <config-editor>` or hold **Shift** to edit it by a :ref:`selected text editor <settings-advanced>`.
ru: Нажмите по нему левой кнопкой мыши и выберите FPS-конфиг для редактирования. Он будет автоматически загружен в :ref:`Редактор конфигов <config-editor>`. Удерживайте клавишу **Shift**, чтобы использовать :ref:`выбранный текстовый редактор <settings-advanced>`.

source: Why does the description of some FPS-configs say that they are not fully compatible with the game?
ru: Почему в описании некоторых FPS-конфигов сказано, что они не полностью совместимы с игрой?

source: Some console variables were marked as cheats and cannot be used on servers without ``sv_cheats 1``.
ru: Разработчики Source игр постоянно вносят в игру изменения, переименовывают названия переменных, блокируют работу без установленного ``sv_cheats 1`` и т.д.

source: Unfortunately, some authors of FPS-configs have abandoned their configs. You can still use them, but their effectiveness may be low.
ru: К сожалению, многие авторы FPS конфигов уже давно забросили их поддержку, поэтому мы соответствующим образом их помечаем. Их использовать можно, но корректная работа и эффективность не гарантируется.

source: Why I cannot use FPS-config in a Team Fortress 2 competitive mode?
ru: Почему установленный FPS конфиг не работает в соревновательном режиме Team Fortress 2?

source: Valve have completely disabled all FPS-configs in Team Fortress 2 competitive mode.
ru: Так решили Valve, полностью заблокировав возможность изменения графических настроек в соревновательном режиме.

source: Cannot download FPS-config or HUD. How can I fix this?
ru: При загрузке FPS-конфига или HUD появляется ошибка. Что делать?

source: Please open :ref:`program settings <settings>` and enable following checkboxes:
ru: Попробуйте в :ref:`настройках программы <settings>` активировать следующие опции, установив около них флажок и нажав кнопку **OK**:

source: **Allow download and install latest (untested) HUDs** (:ref:`common settings <settings-main>` tab) -- should fix issues with downloading HUD files;
ru: **Разрешить установку новейших версий HUD** (страница :ref:`общие настройки <settings-main>`) -- должно решить проблему загрузки файлов HUD;

source: **Use mirrors to download FPS-configs** (:ref:`advanced settings <settings-advanced>` tab) -- should fix issues with downloading FPS-configs.
ru: **Загружать FPS-конфиги с зеркал** (страница :ref:`дополнительные настройки <settings-advanced>`) -- должно решить проблему загрузки файлов FPS-конфигов.
