Repository: xvitaly/srcrepair
Catalog: srcrepair/FrmMainW.*.resx
Languages: ru

# L_GT_LaunchOptions.Text
source: Game launch options:
ru: Параметры запуска:

# L_GT_HDR.Text
source: High Dynamic Range
ru: HDR

# L_GT_DxMode.Text
source: DirectX mode
ru: Режим DirectX

# L_GT_MotionBlur.Text
source: Motion Blur
ru: Размытие движения

# GT_HDR.Items
source: None
ru: Нет

# GT_HDR.Items2
source: Full
ru: Полные

# GT_MotionBlur.Items
source: Disabled
ru: Выключено

# GT_MotionBlur.Items1
source: Enabled
ru: Включено

# L_GT_VSync.Text
source: Wait for vertical sync
ru: Вертик. синхронизация

# L_GT_Filtering.Text
source: Filtering mode
ru: Фильтрация

# L_GT_AntiAliasing.Text
source: Antialiasing mode
ru: Сглаживание

# GT_VSync.Items
source: Disabled
ru: Выключена

# GT_VSync.Items1
source: Enabled
ru: Включена

# GT_Filtering.Items
source: Bilinear
ru: Билинейная

# GT_Filtering.Items1
source: Trilinear
ru: Трилинейная

# GT_Filtering.Items2
source: Anisotropic 2X
ru: Анизотропная 2X

# GT_Filtering.Items3
source: Anisotropic 4X
ru: Анизотропная 4X

# GT_Filtering.Items4
source: Anisotropic 8X
ru: Анизотропная 8X

# GT_Filtering.Items5
source: Anisotropic 16X
ru: Анизотропная 16X

# GT_AntiAliasing.Items
source: None
ru: Нет

# L_GT_ColorCorrectionT.Text
source: Color correction
ru: Коррекция цвета

# L_GT_ShadowQuality.Text
source: Shadow detail
ru: Прорисовка теней

# L_GT_WaterQuality.Text
source: Water detail
ru: Отражения в воде

# GT_ColorCorrectionT.Items
source: Disabled
ru: Выключена

# GT_ColorCorrectionT.Items1
source: Enabled
ru: Включена

# GT_ShadowQuality.Items
source: Low
ru: Низкая

# GT_ShadowQuality.Items1
source: High
ru: Высокая

# GT_WaterQuality.Items
source: Simple reflections
ru: Простые

# GT_WaterQuality.Items1
source: Reflect world
ru: Отражать мир

# GT_WaterQuality.Items2
source: Reflect all
ru: Отражать всё

# L_GT_ShaderQuality.Text
source: Shader detail
ru: Шейдеры

# L_GT_TextureQuality.Text
source: Texture detail
ru: Детализация текстур

# L_GT_ModelQuality.Text
source: Model detail
ru: Детализация моделей

# GT_ShaderQuality.Items
source: Low
ru: Низк.

# GT_ShaderQuality.Items1
source: High
ru: Высок.

# GT_TextureQuality.Items
source: Low
ru: Низкая

# GT_TextureQuality.Items1
source: Medium
ru: Средняя

# GT_TextureQuality.Items2
source: High
ru: Высокая

# GT_TextureQuality.Items3
source: Very high
ru: Очень высокая

# GT_ModelQuality.Items
source: Low
ru: Низкая

# GT_ModelQuality.Items1
source: Medium
ru: Средняя

# GT_ModelQuality.Items2
source: High
ru: Высокая

# L_GT_ScreenType.Text
source: Display mode
ru: Режим запуска

# L_GT_ResVert.Text
source: Vertical resolution
ru: Разрешение по вертикали

# GT_ScreenType.Items
source: Full screen
ru: Полноэкранный

# GT_ScreenType.Items1
source: Windowed
ru: Оконный

# L_GT_ResHor.Text
source: Horisontal resolution
ru: Разрешение по горизонт.

# GT_NCF_MBlur.Items
source: Disabled
ru: Выключено

# GT_NCF_MBlur.Items1
source: Enabled
ru: Включено

# L_GT_NCF_MBlur.Text
source: Motion blur:
ru: Размытие движения:

# GT_NCF_Shadows.Items
source: Very low
ru: Очень низкое

# GT_NCF_Shadows.Items1
source: Low
ru: Низкое

# GT_NCF_Shadows.Items2
source: Medium
ru: Среднее

# GT_NCF_Shadows.Items3
source: High
ru: Высокое

# L_GT_NCF_Shadows.Text
source: Shadow quality:
ru: Качество теней:

# L_GT_NCF_Brightness.Text
source: Brightness:
ru: Яркость:

# GT_NCF_Quality.Items
source: Low
ru: Низкое

# GT_NCF_Quality.Items1
source: Medium
ru: Среднее

# GT_NCF_Quality.Items2
source: High
ru: Высокое

# L_GT_NCF_Quality.Text
source: Model and texture detail:
ru: Качество мод. и текстур:

# GT_NCF_MemPool.Items
source: Low
ru: Низкий

# GT_NCF_MemPool.Items1
source: Medium
ru: Средний

# GT_NCF_MemPool.Items2
source: High
ru: Высокий

# L_GT_NCF_MemPool.Text
source: Paged memory pool:
ru: Доступный пул памяти:

# GT_NCF_EffectD.Items
source: Low
ru: Низкая

# GT_NCF_EffectD.Items1
source: Medium
ru: Средняя

# GT_NCF_EffectD.Items2
source: High
ru: Высокая

# L_GT_NCF_EffectD.Text
source: Effect detail:
ru: Детальность эффектов:

# GT_NCF_ShaderE.Items
source: Low
ru: Низкие

# GT_NCF_ShaderE.Items1
source: Medium
ru: Средние

# GT_NCF_ShaderE.Items2
source: High
ru: Высокие

# GT_NCF_ShaderE.Items3
source: Very High
ru: Очень высокие

# L_GT_NCF_ShaderE.Text
source: Shader detail:
ru: Шейдерные эффекты:

# GT_NCF_Multicore.Items
source: Disabled
ru: Отключён

# GT_NCF_Multicore.Items1
source: Enabled
ru: Включён

# L_GT_NCF_Multicore.Text
source: Multicore rendering:
ru: Многоядерный рендер:

# GT_NCF_VSync.Items
source: Disabled
ru: Отключена

# GT_NCF_VSync.Items1
source: Enabled (double buffered)
ru: Включена (двойной буфер)

# GT_NCF_VSync.Items2
source: Enabled (triple buffered)
ru: Включена (тройной буфер)

# L_GT_NCF_VSync.Text
source: Wait for vertical sync:
ru: Верт. синхронизация:

# GT_NCF_Filtering.Items
source: Bilinear
ru: Билинейная

# GT_NCF_Filtering.Items1
source: Trilinear
ru: Трилинейная

# GT_NCF_Filtering.Items2
source: Anisotropic 2X
ru: Анизотропная 2X

# GT_NCF_Filtering.Items3
source: Anisotropic 4X
ru: Анизотропная 4X

# GT_NCF_Filtering.Items4
source: Anisotropic 8X
ru: Анизотропная 8X

# GT_NCF_Filtering.Items5
source: Anisotropic 16X
ru: Анизотропная 16X

# L_GT_NCF_Filtering.Text
source: Filtering mode:
ru: Режим фильтрации:

# GT_NCF_AntiAlias.Items
source: None
ru: Нет

# L_GT_NCF_AntiAlias.Text
source: Anti-Aliasing mode:
ru: Режим сглаживания:

# GT_NCF_DispMode.Items
source: Full screen
ru: На весь экран

# GT_NCF_DispMode.Items1
source: Windowed
ru: В окне

# GT_NCF_DispMode.Items2
source: Windowed (no border)
ru: В окне (без рамки)

# L_GT_NCF_DispMode.Text
source: Display mode:
ru: Режим отображения:

# L_GT_NCF_VertRes.Text
source: Vertical resolution:
ru: Разрешение по вертик.:

# GT_NCF_Ratio.Items
source: Normal (4:3)
ru: Обычный (4:3)

# GT_NCF_Ratio.Items1
source: Widescreen (16:9)
ru: Широкий (16:9)

# GT_NCF_Ratio.Items2
source: Widescreen (16:10)
ru: Широкий (16:10)

# L_GT_NCF_Ratio.Text
source: Aspect ratio:
ru: Формат экрана:

# L_GT_NCF_HorRes.Text
source: Horisontal resolution:
ru: Разрешение по горизонт.:

# GT_SaveApply.Text
source: Save settings
ru: Сохранить

# GT_Maximum_Performance.Text
source: Maximum performance
ru: Максимальная производительность

# GT_Maximum_Graphics.Text
source: Maximum quality
ru: Максимальное качество

# GraphicTweaker.Text
source: Graphic Tweaker
ru: Графические настройки

# CE_New.Text
source: Create new config
ru: Создать новый конфиг

# CE_Open.Text
source: Open config from file
ru: Открыть конфиг из файла

# CE_Save.Text
source: Save config
ru: Сохранить изменения в файл

# CE_SaveAs.Text
source: Save config as...
ru: Сохранить конфиг как...

# CE_Cut.Text
source: Cut
ru: Вырезать

# CE_Copy.Text
source: Copy
ru: Копировать

# CE_Paste.Text
source: Paste
ru: Вставить

# CE_RmRow.Text
source: Delete selected row
ru: Удалить выбранную строку

# CE_OpenInNotepad.Text
source: Open config in Notepad
ru: Открыть конфиг в Блокноте

# CE_ManualBackUpCfg.Text
source: BackUp current config file
ru: Создать бэкап конфига

# CE_ShowHint.Text
source: Show hint (F7)
ru: Подсказка (F7)

# CE_OpenCVList.Text
source: Show full cvarlist
ru: Русскоязычное описание переменных

# CE_CVName.HeaderText
source: Variable
ru: Переменная

# CE_CVal.HeaderText
source: Value
ru: Значение переменной

# ConfigEditor.Text
source: Config Editor
ru: Редактор конфигов

# PS_CheckCache.Text
source: Validate game cache files
ru: Проверить целостность игрового кэша

# PS_RemOldBin.Text
source: Remove old binaries and launchers
ru: Очистить старые бинарники и лаунчеры

# PS_RemGameOpts.Text
source: Clean game settings (+video)
ru: Очистить все настройки игры

# PS_GB_AdvRepr.Text
source: Advanced cleanup:
ru: Расширенная очистка:

# PS_RemReplays.Text
source: Replays
ru: Реплеи (повторы)

# PS_DeepCleanup.Text
source: Deep cleanup
ru: Глубокая очистка

# PS_RemTextures.Text
source: Models and textures
ru: Модели и текстуры

# PS_RemDemos.Text
source: Recorded demos
ru: Записанные демки

# PS_RemScreenShots.Text
source: Screenshots
ru: Скриншоты

# PS_RemSecndCache.Text
source: Secondary cache
ru: Вторичный кэш

# PS_RemSoundCache.Text
source: Graph and sound cache
ru: Звуковой кэш

# PS_RemConfigs.Text
source: FPS-configs
ru: Игровые конфиги

# PS_RemSounds.Text
source: Custom sounds
ru: Кастомные звуки

# PS_RemCustDir.Text
source: Custom directory
ru: Кастомный каталог

# PS_RemDnlCache.Text
source: Download cache
ru: Кэш загрузок

# PS_RemCustMaps.Text
source: Custom maps
ru: Кастомные карты

# PS_GB_Remover.Text
source: Safe cleanup:
ru: Безопасная очистка:

# PS_PathGame.Text
source: Game path
ru: Путь к игре

# PS_PathSteam.Text
source: Steam path
ru: Путь к Steam

# PS_OSDrive.Text
source: File system on Steam drive: {0}
ru: Файловая система на диске: {0}

# PS_StPath.Text
source: Steam path: {0}
ru: Путь к Steam: {0}

# PS_GB_SInfo.Text
source: General infomation
ru: Информация о текущей установке

# PS_ExecuteNow.Text
source: Cleanup Now!
ru: Выполнить!

# PS_SteamLang.Items
source: English
ru: Английский (English)

# PS_SteamLang.Items1
source: Russian
ru: Русский (Russian)

# L_PS_SteamLang.Text
source: Select Steam language:
ru: Выберите язык Steam:

# PS_CleanRegistry.Text
source: Clean all Steam registry entries
ru: Очистить записи Steam, хранящиеся в реестре

# PS_CleanBlobs.Text
source: Clean .blob files from Steam directory
ru: Очистить .blob-файлы из каталога Steam

# PS_GB_Solver.Text
source: Clean Steam settings and blobs
ru: Устранение проблем Steam

# ProblemSolver.Text
source: Troubleshooting & Cleanup
ru: Устранение проблем и очистка

# FP_Uninstall.Text
source: Remove installed config
ru: Удалить имеющийся конфиг

# FP_Install.Text
source: Install selected config
ru: Установить выбранный конфиг

# FP_Comp.Text
source: This config has known compactibility issues with selected game!
ru: Выбранный FPS-конфиг не полностью совместим с данной игрой!

# FP_GB_Desc.Text
source: Description of selected FPS-config
ru: Подробное описание выбранного конфига

# L_FP_ConfigSel.Text
source: Select one of available configs:
ru: Выберите один из конфигов:

# FP_TopLabel.Text
source: On this page you can install one of available and tested by us FPS-configs into the game. FPS-config is a file autoexec.cfg, which can significantly increase the performance of the game with loss of a picture quality. You can edit installed FPS-config manually later in Config Editor tab. Attention! If you use FPS-config the Graphic Tweaker will not be able to edit graphic settings (the settings obtained from the config have higher priority).
ru: На этой странице Вы можете установить один из доступных и протестированных нами FPS-конфигов в игру. Конфиг представляет собой файл autoexec.cfg, который способен значительно увеличить производительность игры с потерей качества выдаваемой картинки. Установленный конфиг Вы можете редактировать в Редакторе. Внимание! Если Вы используете конфиг, то редактор графических настроек не сможет редактировать их (настройки, полученные из конфига, имеют более высокий приоритет).

# FPSCfgInstall.Text
source: FPS-Configs
ru: FPS-конфиги

# HD_Uninstall.Text
source: Uninstall selected HUD
ru: Удалить выбранный HUD

# HD_Install.Text
source: Install selected HUD
ru: Установить выбранный HUD

# HD_GB_Desc.Text
source: Selected HUD information
ru: Информация о выбранном HUD

# L_HD_HSel.Text
source: Select HUD from list:
ru: Выберите HUD:

# HD_WelcMsg.Text
source: On this page you can install one of available and tested by us HUDs into the game. Please do not install more than one HUD because it can lead to unpredictable consequences. Each HUD has readme file and screenshot. Select one from list and you will be able to see it.
ru: Здесь вы можете установить один из протестированных нами HUD в игру. Не устанавливайте более одного HUD, т.к. это может привести к непредсказуемым последствиям. Выберите HUD из списка чтобы увидеть его скриншот.

# HUD_NAText.Text
source: No HUDs available for selected game!
ru: Нет доступных HUD для данной игры!

# HUDInstall.Text
source: HUD Manager
ru: Менеджер HUD

# BU_LV_Name.Text
source: Name
ru: Имя

# BU_LV_Type.Text
source: Type
ru: Тип

# BU_LV_Size.Text
source: Size
ru: Размер

# BU_LV_Date.Text
source: Date
ru: Дата создания

# BUT_Refresh.Text
source: Update BackUp list...
ru: Обновить список резервных копий...

# BUT_RestoreB.Text
source: Restore BackUp
ru: Восстановить выбранную резервную копию

# BUT_DelB.Text
source: Delete BackUp
ru: Удалить выбранную резервную копию

# BUT_OpenNpad.Text
source: Open BackUp in Notepad
ru: Открыть выбранную резервную копию в Блокноте

# BUT_ExploreBUp.Text
source: Show BackUp file in Windows Explorer
ru: Показать выбранную резервную копию в Проводнике

# BUT_L_GameSettings.Text
source: BackUp game settings
ru: Создать бэкап графических настроек

# BUT_L_AllSteam.Text
source: BackUp all Steam settings
ru: Создать бэкап всех настроек Steam

# BUT_L_AllSRC.Text
source: BackUp all Source games settings
ru: Создать бэкап настроек всех Source-игр

# BUT_CrBkupReg.Text
source: Create registry backup...
ru: Создать резервную копию реестра

# RescueCentre.Text
source: BackUp Center
ru: Резервные копии

# MNUShowEdHint.Text
source: &Show hint
ru: &Показать подсказку

# MNUAppOptions.Text
source: Optio&ns
ru: Н&астройки SRC Repair...

# MNUReportBuilder.Text
source: &Create a report for the Support...
ru: Создание отч&ёта для Техподдержки...

# MNUInstaller.Text
source: Q&uick add-on installer...
ru: Модуль &быстрой установки...

# MNUWinMnuDisabler.Text
source: S&ystem buttons disabler...
ru: &Модуль отключения системных клавиш...

# MNUMuteMan.Text
source: &In-game mute manager
ru: Управлен&ие отключёнными игроками

# MNUExtClnSteam.Text
source: Start &Steam cleaner...
ru: Модуль &очистки кэшей Steam...

# MNUExtClnAppCache.Text
source: SRC Repair's d&ownload cache
ru: Кэш з&агрузок SRC Repair

# MNUExtClnTmpDir.Text
source: S&ystem temporary directory
ru: &Временные файлы системы

# MNUExtClnSub.Text
source: Exten&ded cleanup
ru: Модуль расширенной о&чистки

# MNUExit.Text
source: E&xit
ru: &Выход

# ToolsMNU.Text
source: &Tools
ru: &Инструменты

# MNUHelp.Text
source: &Offline help system
ru: Справоч&ная система SRC Repair

# MNUUpdateCheck.Text
source: Chec&k for Updates...
ru: Пров&ерить наличие обновлений...

# MNUOpinion.Text
source: Give &feedback
ru: Оставить отз&ыв о программе

# MNUReportBug.Text
source: Report a &bug
ru: Сооб&щить об ошибке в программе

# MNUShowLog.Text
source: &Show debug log...
ru: &Показать отладочный журнал...

# MNUSteamGroup.Text
source: S&team group
ru: Офи&циальная группа в Steam

# MNUAbout.Text
source: Abo&ut SRC Repair...
ru: &О программе

# HelpMNU.Text
source: &Help
ru: &Справка

# CE_OpenCfgDialog.Filter
source: Config files (*.cfg)|*.cfg
ru: Файлы конфигов (*.cfg)|*.cfg

# CE_SaveCfgDialog.Filter
source: Config files (*.cfg)|*.cfg
ru: Файлы конфигов (*.cfg)|*.cfg

# $this.Text
source: {0} for {1} (version {2})
ru: {0} для {1} (версия {2})
