Repository: xvitaly/srcrepair
Catalog: srcrepair/FrmStmClean.*.resx
Languages: ru

# EC_ShaderCache.Text
source: Steam shader cache
ru: Кэш шейдеров клиента Steam

# EC_DepotCache.Text
source: Steam client depot cache
ru: Depot кэш клиента Steam

# EC_HTTPCache.Text
source: Steam client HTTP download cache
ru: HTTP кэш клиента Steam

# EC_HTMLCache.Text
source: Steam client and overlay HTML cache
ru: HTML кэш клиента и оверлея Steam

# EC_GB_Basic.Text
source: Basic caches
ru: Очистка кэшей

# EC_BuildCache.Text
source: Steam build cache
ru: Временный каталог обновлений игр

# EC_ErrDmps.Text
source: Steam error dumps
ru: Краш-дампы клиента Steam

# EC_OldBins.Text
source: Steam old binaries
ru: Старые бинарники клиента Steam

# EC_Logs.Text
source: Steam client logs
ru: Журналы работы клиента Steam

# EC_GB_Garb.Text
source: Basic garbage
ru: Базовая очистка

# EC_Skins.Text
source: Steam custom skins
ru: Кастомные скины Steam

# EC_Music.Text
source: Steam music database
ru: База данных сервиса Steam Music

# EC_Stats.Text
source: Steam local game stats
ru: Локальная игровая статистика

# EC_Cloud.Text
source: Steam Cloud local storage
ru: Локальное зеркало Steam Cloud

# EC_GameIcons.Text
source: Steam cached game icons
ru: Кэшированные значки игр

# EC_GB_ExCn.Text
source: Extended cleanup
ru: Улучшенная очистка

# EC_Execute.Text
source: Start cleanup...
ru: Запустить очистку...

# EC_Guard.Text
source: Steam Guard cache
ru: Очистка кэша Steam Guard

# EC_Updater.Text
source: Steam updater cache
ru: Очистка обновлений Steam

# EC_GB_Trsh.Text
source: Troubleshooting
ru: Специальные виды очистки

# $this.Text
source: Steam extended cleaner
ru: Модуль очистки Steam
