Repository: xvitaly/srcrepair
Catalog: docs/help/source/locale/*/LC_MESSAGES/cleanup.po
Languages: ru

source: Troubleshooting and cleanup
ru: Устранение проблем и очистка

source: With tools, presented on this page, you can resolve most of the known Steam and Source Engine games issues. Also you can clean up garbage, accumulated in game on regular daily use.
ru: Инструменты, представленные на этой странице позволяют решать большинство известных проблем, с которыми сталкиваются пользователи Steam и Source-игр, а также очищать выбранную игру от различного мусора, который накапливается при её использовании.

source: Troubleshooting and recovery
ru: Устранение проблем и восстановление

source: To run Steam client recovery, enable **Clean .blob files from Steam directory** or/and **Clean all registry entries** (require admin rights; not available on non-Windows platforms) checkboxes, then press **Cleanup Now!** button.
ru: Чтобы запустить восстановление Steam, нужно установить галочки в чекбоксы **Очистить .blob-файлы из каталога Steam** и/или **Очистить записи Steam, хранящиеся в реестре** (недоступно на платформах, отличных от Microsoft Windows) и нажать кнопку **Выполнить!**.

source: Warning! Steam client will be automatically terminated (if running).
ru: Внимание! После нажатия кнопки **Выполнить**, все процессы Steam будут автоматически завершены (если он был запущен).

source: Known issues, can be resolved by this tool:
ru: Известные проблемы, исправляемые данным модулем:

source: Steam logon errors;
ru: ошибки входа в Steam;

source: errors like **Steam servers are not available**, **This game is not available at this time**, **No Steam connection**, **Could not connect to Steam network**, etc.;
ru: ошибки типа **Серверы Steam перегружены**, **Эта игра недоступна в настоящее время**, **Ошибка подключения к серверам Steam**;

source: endless Steam connection to servers;
ru: ошибки бесконечного подключения к серверам (Steam делает вид, что подключается, но ничего не происходит);

source: some issues, related to Friends system;
ru: ошибки, связанные со списком друзей (например, после выхода из игры статус остаётся **В игре** и не меняется длительное время и т.д.);

source: damaged Steam installation (after running this, Steam client will be re-downloaded from official servers);
ru: повреждённые файлы Steam, например, после неправильного выхода из него за счёт их принудительного обновления с официальных серверов;

source: some other issues.
ru: множество других ошибок.

source: Principle of operation
ru: Принцип работы инструмента восстановления

source: If **Clean .blob files from Steam directory** is checked, SRC Repair will get Steam installation directory path, find and remove files with .blob extension, and force Steam recovery on next launch. Warning! Steam can force you to login again after performing this action.
ru: При выборе пункта **Очистить .blob-файлы из каталога Steam**, программа получает из реестра путь установки Steam и удаляет оттуда файлы с расширением blob, а также прописывает следующий запуск Steam в режиме обновления. Внимание! При выборе этой опции при следующем запуске в режиме обновления Steam потребует повторно авторизоваться в сервисе, т.к. файлы blob, содержащие служебную информацию, были удалены.

source: If **Clean all registry entries** is checked, SRC Repair will remove ``HKEY_CURRENT_USER\Software\Valve\Steam`` registry key, modify some values in ``HKEY_LOCAL_MACHINE\Software\Valve\Steam`` (only when running with admin rights), and force Steam recovery on next launch. You will need to select Steam language from list.
ru: При выборе пункта **Очистить записи Steam, хранящиеся в реестре**, программа удаляет содержимое ключа реестра ``HKEY_CURRENT_USER\Software\Valve\Steam``, модифицирует содержимое ``HKEY_LOCAL_MACHINE\Software\Valve\Steam``, исправляя известные ошибки в них, а также указывает Steam при следующем запуске запуститься в режиме восстановления. При выборе этой опции, нужно обязательно указать язык, который будет использовать внутри интерфейса Steam.

source: Installation path checker
ru: Служба обнаружения некорректного пути

source: This tool will automatically check for restricted (non-ASCII) symbols in Steam installation directory path. Steam path should contain only latin letters and numbers. All other can cause major issues with games, compiled without Unicode support.
ru: Проверяет путь Steam на наличие в нём запрещённых символов: русских, немецких, французских и т.д. букв, а также прочих символов юникода. Данные символы создают проблемы при запуске некоторых игр, не поддерживающих юникод.

source: If any restricted symbols were found, a warning message will be shown. Also you will see a red sign in **General information** section.
ru: Если запрещённые символы будут найдены, то будет выдано сообщение об этом, а также вы увидите красный значок в группе **Информация о текущей установке Steam**.

source: This tool starts automatically with SRC Repair and cannot be disabled.
ru: Данная служба запускается автоматически при каждом запуске SRC Repair и не может быть отключена.

source: Game cleanup wizard
ru: Служба очистки игр и удаления ненужных данных

source: This tool allow you to clean up garbage, accumulated in game on regular daily use. It can free-up lots of disk space.
ru: Позволяет пользователю быстро и безболезненно удалить ненужные и/или устаревшие данные и кэши, которые способны занимать на жёстком диске несколько сотен мегабайт свободного места.

source: After selecting cleanup action, :ref:`safe clean window <modules-cleanup>` will appear. You can manually check the list of files, marked to deletion.
ru: После выбора варианта очистки программа произведёт поиск ненужных данных и выдаст :ref:`отдельное окно модуля очистки <modules-cleanup>`, в котором вы сможете просмотреть список файлов, помеченных для удаления.

source: If you don't want to remove some file, uncheck checkbox near its name. All marked files will be removed.
ru: Если около имени файла стоит флажок, значит он будет удалён при запуске очистки. Чтобы оставить файл, просто уберите флажок около него.

source: When done, press **Execute cleanup** button to run cleanup sequence. If you changed your mind -- press **Cancel**.
ru: Для запуска очистки нажмите кнопку **Выполнить очистку**, а для выхода без очистки -- **Отмена**.

source: Currently supported by SRC Repair cleanu actions:
ru: В настоящее время SRC Repair способен выполнять следующие варианты очистки:

source: **custom maps** -- remove downloaded or installed custom maps. This will free lots of disk space and can speed-up game startup;
ru: **кастомные карты** -- удаляет нестандартные карты, скачанные с серверов. Это позволит ускорить запуск игры (Source-игра при своём запуске их считывает чтобы добавить в список доступных карт) и освободить много места на жёстком диске (от нескольких сотен мегабайт до нескольких гигабайт);

source: **download cache** -- remove downloaded from game servers data: personal sprays of all players, you ever seen on servers, different partial downloaded or damaged during download files, etc. Contains garbage. We recommend to run this cleanup at least once a week;
ru: **кэш загрузок** -- содержит данные, когда-либо скачанные с игровых серверов, спреи всех игроков, когда-либо игравших вместе с вами на игровом сервере, а также недокачанные и повреждённые во время скачивания файлы. Способен занимать сотни мегабайт. Содержит абсолютно ненужные данные. Рекомендуется очищать несколько раз в месяц;

source: **custom directory** -- remove installed custom modifications from ``/custom`` directory (only if supported by game);
ru: **кастомный каталог** -- удаляет все установленные нестандартные модификации игры, расположенные в ``/custom`` (если поддерживается выбранной игрой);

source: **custom sounds** -- remove sound files downloaded from game servers;
ru: **кастомные звуки** -- очищает загруженные с серверов и установленные пользователем нестандартные звуковые файлы;

source: **FPS-configs** -- remove installed :ref:`FPS-configs <fps-about>`;
ru: **FPS-конфиги** -- позволяет удалить все установленные :ref:`FPS-конфиги <fps-about>`;

source: **graph and sound cache** -- remove sound and graphic caches, created by game. It can fix some issues. Will be automatically created on next game launch;
ru: **звуковой кэш** -- удаляет звуковой кэш, созданный игрой. Используйте в случаях его повреждения, либо для оптимизации. Кэш будет создан заново при следующем запуске игры;

source: **secondary cache** -- remove downloaded from game servers cache files. We recommend to run this cleanup at least once a month;
ru: **вторичный кэш** -- содержит данные, скачанные с игровых серверов. Рекомендуется очищать несколько раз в месяц;

source: **screenshots** -- remove screenshots from ``/screenshots`` directory. Can free-up lots of disk space;
ru: **скриншоты** -- удаляет скриншоты из подкаталога ``/screenshots``. Удаление скриншотов способно освободить от нескольких сотен мегабайт до десятка гигабайт места на диске;

source: **recorded demos** -- remove downloaded or installed demo files (files \*.dem) from game directory;
ru: **записанные демки** -- удаляет все записанные или установленные демки (файлы \*.dem), находящиеся в каталоге игры. Это способно освободить от нескольких десятков до нескольких сотен мегабайт места на диске;

source: **models and textures** -- remove models and textures downloaded from game servers or installed by different custom modifications;
ru: **модели и текстуры** -- позволяет удалить нестандартные текстуры и модели, установленные пользователем, либо скачанные с игровых серверов;

source: **deep cleanup** -- try to remove all garbage from game at once. You **must** run game :ref:`cache verification <cleanup-advanced>` after running this cleanup;
ru: **глубокая очистка** -- запускает удаление всего возможного мусора, а также старых бинарников, кэшей и конфигов. По окончании **необходимо** запустить :ref:`проверку целостности кэша <cleanup-advanced>`;

source: **replays** -- remove files, created by Replays system (only if supported by game).
ru: **реплеи (повторы)** -- удаляет файлы и кэши, созданные системой Replay.

source: Deep cleanup
ru: Служба специальной очистки

source: **Clean game settings (+video)** -- reset all in-game video settings. Backup file will be created.
ru: **Очистить все настройки игры** -- позволяет полностью удалить графические и прочие настройки управляемой игры. Перед удалением будет создана резервная копия.

source: **Remove all binaries and launchers** -- remove game binaries and launchers (contents of ``/bin``, ``/{game}/bin`` directories and ``/hl2.exe`` file). Use this if you have issues with starting game, crashes of different origin, etc. You **must** validate game cache after running this cleanup.
ru: **Очистить старые бинарники и лаунчеры** -- полностью удаляет двоичные файлы, которые используются для запуска программы (содержимое каталогов ``/bin``, ``/{game}/bin`` и файл ``/hl2.exe``). Используйте данный вариант очистки если игра у Вас не запускается, либо вылетает сразу после запуска с ошибкой. Данный вариант полностью безопасен. После окончания очистки запустите проверку целостности кэша.

source: **Validate game cache files** -- force game cache verification. Will check all game files and re-download corrupted or missing. You must run this process after running deep cleanup or removing game binaries and launchers.
ru: **Проверить целостность игрового кэша** -- запускает проверку файлов игры на наличие повреждений, а также докачивает отсутствующие. Рекомендуется запускать после выполнения глубокой очистки, а также удаления старых бинарников и лаунчеров.
