Repository: xvitaly/srcrepair
Catalog: docs/help/source/locale/*/LC_MESSAGES/modules.po
Languages: ru

source: Additional modules
ru: Дополнительные модули

source: Report builder
ru: Модуль создания отчётов для техподдержки

source: This module will automatically generate reports for official support service or different community forums.
ru: Данный модуль предназначен для полностью автоматического создания отчётов для официальной службы поддержки Valve, либо неофициальной поддержки различных форумов.

source: Only Microsoft Windows platform is supported.
ru: Поддерживается лишь операционная система Microsoft Windows.

source: To create a new report:
ru: Для того, чтобы создать отчёт, выполните следующие действия:

source: select **Tools** -- **Report builder** menu entry or just press **F12** on keyboard;
ru: в меню **Инструменты** выберите пункт **Создание отчёта для Техподдержки** или просто нажмите клавишу **F12** на клавиатуре;

source: press **Generate report!** button and wait from 1 to to 5 minutes (depends on your system);
ru: нажмите на кнопку **Создать отчёт** и подождите от 1 до 5 минут (зависит от производительности системы);

source: you will see generated Zip-file in a default file manager.
ru: через некоторое время вы увидите созданный Zip-файл в Проводнике Windows.

source: Report builder is using only integrated into Microsoft Windows utilities. The following information will be included in the final report:
ru: Для создания отчётов используются только утилиты, входящие в состав Microsoft Windows. В отчёт будет включена следующая информация:

source: common information about hardware, software and operation system using MSInfo;
ru: общая информация о компьютере и комплектующих, запущенных процессах, установленном ПО;

source: DirectX information;
ru: конфигурация DirectX;

source: generic network information: routes, netstat;
ru: о сетевых маршрутах данного компьютера;

source: ping and traceroute to Valve servers;
ru: замеры пинга и потерь пакетов до серверов Valve;

source: game configs;
ru: игровые конфиги текущей игры;

source: Steam logs;
ru: журналы работы Steam;

source: Steam crash dumps;
ru: краш-дампы Steam;

source: contents of Hosts file.
ru: содержимое файла Hosts.

source: Report is a simple Zip-file, so you can load it by any archiver and check its contents before uploading to anywhere.
ru: Отчёт представляет собой обычный Zip-архив, поэтому он может быть открыт в любом архиваторе для изучения содержимого перед отправкой куда-либо.

source: Program updater
ru: Модуль обновления программы

source: You can start this module from **Help** -- **Check for updates** menu.
ru: Вызывается из меню **Справка** -- **Проверить наличие обновлений**.

source: Updater will check updates for the following:
ru: Будут проверено наличие новых версий следующих компонентов:

source: main program;
ru: сама программа;

source: game database;
ru: база данных игр;

source: HUD database.
ru: база данных HUD.

source: SRC Repair will automatically check for updates once a week (can be disabled in :ref:`advanced settings <settings-advanced>`).
ru: SRC Repair будет автоматически проверять наличие новых версий один раз в неделю (может быть отключено в :ref:`дополнительных настройках <settings-advanced>`).

source: Database are being download from repository and copied to the installation directory.
ru: Обновления баз данных загружаются из репозитория, а затем копируются в каталог установки программы.

source: Program updates are being downloaded from CDN as a standalone installers.
ru: Обновления самого приложения загружаются в виде дистрибутива новой версии и все действия по обновлению уже установленного выполняются непосредственно им.

source: If updates we found, you can install them by left clicking on message.
ru: В случае если найдено обновление какого-либо компонента, кликнете по сообщению левой кнопкой мыши для его скачивания и установки.

source: If SRC Repair is installed for all users to a system protected directory like **%PROGRAMFILES%**, UAC dialog will appear.
ru: Если SRC Repair была установлена глобально для всех пользователей системы в каталог **%PROGRAMFILES%**, либо иное место, где у текущего пользователя нет прав на запись, то для установки обновлений потребуются права администратора.

source: Quick add-on installer
ru: Модуль быстрой установки

source: This module will allow you to easily install into selected game the following custom content:
ru: Данный модуль позволяет легко и быстро установить в выбранную в главном окне SRC Repair игру следующий контент:

source: **sprays** (files **\*.vtf**);
ru: **спреи** (файлы **\*.vtf**);

source: **demos** (files **\*.dem**);
ru: **демки** (файлы **\*.dem**);

source: **game configs** (files **\*.cfg**);
ru: **конфиги** (файлы **\*.cfg**);

source: **custom maps** (files **\*.bsp**);
ru: **карты** (файлы **\*.bsp**);

source: **game packages** (files **\*.vpk**);
ru: **игровые пакеты** (файлы **\*.vpk**);

source: **binary plugins** (files **\*.dll**);
ru: **бинарные плагины** (файлы **\*.dll**);

source: **hit and kill sounds** (files **killsound.wav** or **hitsound.wav**);
ru: **звуки попадания** по противнику (файлы **killsound.wav** или **hitsound.wav**);

source: **content archives** (files **\*.zip**).
ru: **игровые архивы** (файлы файлы **\*.zip**).

source: Press **Browse** button and find required file on disk. Don't forget to change **File type** if you cannot find it.
ru: Для запуска установки просто нажмите кнопку **Найти** и выберите на диске нужный файл (не забудьте в пункте **Тип файлов** указать что именно планируете установить в игру), затем нажмите **Открыть**.

source: Now press **Install** button to install selected file.
ru: Теперь можете нажать кнопку **Установить** для запуска процесса. Выбранный файл будет установлен и программа сообщит вам о результате.

source: Installation will be performed in the game's custom directory (if supported). Do not install content from untrusted sources.
ru: Установка производится в пользовательский каталог модификаций (если это поддерживается игрой). Не устанавливайте контент из непроверенных источников.

source: System buttons disabler
ru: Модуль отключения системных клавиш

source: Most of gamers are getting annoyed by accidentally pressed Windows button. Some of them are even removing it physically from keyboard.
ru: Большинство игроков раздражает случайное нажатие клавиши Windows на клавиатуре, т.к. игра при этом сворачивается, а на восстановление требуется достаточно длительное время. Некоторые даже удаляют её физически из клавиатуры.

source: This module will allow you to disable both Windows and Context keys.
ru: С помощью данного модуля вы можете отключить обе клавиши Windows и клавишу Menu (Context), которая также вызывает сворачивание игры и вызов контекстного меню окна.

source: Supported actions:
ru: Допустимые действия:

source: **Disable left WIN** -- disable only left Windows button;
ru: **отключить левую WIN** -- отключает левую клавишу Windows, правая остаётся работоспособной;

source: **Disable both WIN** -- disable both left and right Windows buttons;
ru: **отключить обе WIN** -- отключает одновременно и левую, и правую клавиши Windows;

source: **Disable right WIN and MENU** -- disable right Windows and Menu (Context) buttons;
ru: **отключить правую WIN и MENU** -- отключает правую клавишу Windows и клавишу Menu (Context); левая при этом остаётся работоспособной;

source: **Disable both WIN and MENU** -- disable both left and right Windows and Menu (Context) buttons;
ru: **отключить обе WIN и MENU** -- отключает обе клавиши Windows и Menu (Context);

source: **Restore default settings** -- restore Windows default settings.
ru: **вернуть стандартные настройки** -- отменяет настройки, сделанные плагином и возвращает настройки Windows по умолчанию.

source: Local administrator rights are required in order to change keyboard settings. Only Microsoft Windows platform is supported.
ru: Для работы этого модуля необходимы права локального администратора. Модуль отключения системных клавиш поддерживает только ОС Microsoft Windows.

source: Muted players manager
ru: Модуль управления отключёнными игроками

source: With the help of this module you can easily control the list of muted and ignored players in a selected game.
ru: Данный модуль предназначен для простого и быстрого управления базой данных игнорируемых игроков (тем, кому отключён голосовой и/или текстовый чат внутри игры).

source: To add a new row, just start typing text in the last cell.
ru: Чтобы добавить новую строку просто начинайте набирать текст в последней пустой строке программы.

source: SteamID32 (legacy) and SteamIDv3 formats are only supported. Legacy entry can be converted to a new one by pressing **Convert SteamID format** button on the main toolbar or from context menu.
ru: Допускается ввод SteamID в форматах SteamID32 (устаревший) и SteamIDv3. В модуле присутствует штатная функция конвертирования SteamID из старого формата в новый. Для этого просто выберите строку и нажмите кнопку **Преобразовать SteamID** на панели инструментов или из контекстного меню.

source: To remove currently selected row, press **Remove selected row** button on the main toolbar, or press **Delete** on keybooard. You can select and remove multiple rows at once.
ru: Чтобы удалить активную строку, нажмите кнопку **Удалить строку** на панели инструментов редактора или клавишу **Delete** на клавиатуре компьютера. Присутствует возможность удаления сразу нескольких строк. Для этого выделите их мышью, либо с помощью клавиатуры.

source: If you want to show selected user profile in Web browser, press **Open Steam profile** button on the main toolbar or from context menu.
ru: При нажатии на кнопку **Показать профиль Steam** профиль выбранного в ячейке пользователя будет загружен в используемом по умолчанию веб-браузере.

source: Press **Save** button on the main toolbar to save changes.
ru: Чтобы сохранить изменения, нажмите кнопку **Сохранить** на панели инструментов.

source: If safe clean is enabled (green light in status bar), backup file will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включена опция безопасной очистки (в статусной строке программы горит зелёный индикатор), то будет автоматически создана резервная копия, которую вы сможете восстановить в любое время на странице :ref:`Резервные копии <backups-about>`.

source: Cleanup module
ru: Модуль очистки

source: This module cannot be invoked directly by user. It used by different cleanup methods from :ref:`trobleshooting and cleanup <cleanup-wizard>` tab and by :ref:`extended cleanup module <modules-stmcln>`.
ru: Данный модуль не может вызываться непосредственно пользователем. Его используют другие механизмы приложения, в частности инструменты с вкладки :ref:`Устранение проблем и очистка <cleanup-wizard>`, а также :ref:`модуль расширенной очистки Steam <modules-stmcln>`.

source: Main window consists of table with candidates for deletion, control buttons and a progress bar.
ru: Главное окно модуля очистки отображает отмеченные для удаления файлы.

source: Depending on cleanup type, files can be marked for deletion automatically or not.
ru: В зависимости от вида очистки и заданного в главном окне режиме безопасности, они могут как помечаться автоматически, так и нет.

source: Press **Execute cleanup button** to start cleanup sequence. All marked by checkbox files will be removed.
ru: Все файлы, отмеченные флажком около имени, будут удалены *без возможности восстановления* если вы запустите очистку посредством нажатия кнопки **Выполнить очистку**.

source: If you changed your mind, press **Cancel** button. No actions will be performed.
ru: Если передумали, нажмите кнопку **Отмена**. В этом случае никаких действий предпринято не будет.

source: If you want to create backups before running cleanup for all files, enable checkbox **Compress files to zip before deletion** in :ref:`common settings <settings-main>`. It will take a long time (depending on the number of files). You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если вы хотите, чтобы перед удалением была создана резервная копия, в настройках программы установите флажок в чекбокс **Создавать бэкап перед запуском очистки** (в :ref:`общих настройках <settings-main>`). Создание резервной копии может занять много времени (зависит от количества и размера удаляемых файлов). Созданную резервную копию вы сможете восстановить на странице :ref:`Резервные копии <backups-about>`.

source: You will see progress bar with status during operation.
ru: Во время работы будет подробно отображаться прогресс очистки.

source: Cleanup module support the following hotkeys:
ru: В главном окне модуля очистки доступны следующие клавиатурные комбинации:

source: **Ctrl + A** -- mark all files for deletion;
ru: **Ctrl + A** -- отметить все файлы;

source: **Ctrl + D** -- deselect all files;
ru: **Ctrl + D** -- снять отметку со всех файлов;

source: **Ctrl + R** -- invert selection;
ru: **Ctrl + R** -- инвертировать выделение;

source: **Ctrl + C** -- copy marked file names with full path to clipboard.
ru: **Ctrl + C** -- скопировать имена выделенных файлов с полными путями в буфер обмена.

source: Steam cleanup module
ru: Модуль расширенной очистки кэшей Steam

source: This module will find and remove garbage, accumulated on regular daily use. We recommend to run it at least once a month.
ru: Данный модуль предназначен для простой и быстрой очистки различных кэшей Steam, в которых накапливаются десятки гигабайт никому не нужных файлов. Рекомендуется производить запуск данного модуля не реже, чем раз в две недели для поддержания чистоты на диске.

source: You need to select one or multiple checkboxes and then press **Execute cleanup** button. :ref:`Cleanup module <modules-cleanup>` window will appear.
ru: Для начала работы сначала следует выбрать один или несколько чекбоксов, после чего нажать кнопку **Запустить очистку**. Далее вы увидите окно :ref:`модуля очистки <modules-cleanup>`.

source: Available cleanup options:
ru: Доступные опции очистки:

source: basic caches:
ru: очистка кэшей:

source: **Steam client and overlay HTML cache** -- Steam built-in Chromium Embedded Framework web cache;
ru: **HTML кэш клиента и оверлея Steam** -- кэш встроенного в клиент Steam и игровой оверлей веб-браузера на базе Chromium Embedded Framework;

source: **Steam client HTTP download cache** -- HTTP client download cache;
ru: **HTTP кэш клиента Steam** -- HTTP кэш клиента с различными заголовками и метаддаными;

source: **Steam client depot cache** -- partially downloaded files and depots cache;
ru: **Depot кэш клиента Steam** -- кэш с частично загруженными файлами и различными блобами;

source: **Steam shader cache** -- cache of downloaded compiled shader files;
ru: **кэш шейдеров клиента Steam** -- кэш загруженных или сгенерированных на клиенте шейдеров;

source: **Steam library cache** -- Steam Library cache;
ru: **кэш библиотеки Steam** -- кэш файлов, используемых Библиотекой Steam;

source: basic garbage:
ru: базовая очистка:

source: **Steam client logs** -- Steam client logs (files **\*.log**);
ru: **журналы работы клиента Steam** -- все найденные журналы работы клиента (файды **\*.log**);

source: **Steam old binaries** -- no longer needed old binaries and launchers (files **\*.old**);
ru: **старые бинарники Steam** -- все предыдущие и уже не актуальные версии бинарников и лаунчеров клиента (файлы **\*.old**);

source: **Steam error dumps** -- generated by Steam crash reports and dumps (files **\*.dmp** and **\*.mdmp**);
ru: **краш-дампы клиента Steam** -- все созданные клиентом и запущенными играми краш-дампы (файлы **\*.dmp** и **\*.mdmp**);

source: **Steam build cache** -- updates temporary directory;
ru: **временный каталог обновлений игр** -- всё содержимое временного каталога, в котором подготавливаются обновления к установке;

source: extended cleanup:
ru: улучшенная очистка:

source: **Steam cached game icons** -- Steam Library cached game icons;
ru: **кэшированные значки игр** -- кэш значков игр из текущей Библиотеки Steam;

source: **Steam Cloud local storage** -- Steam Cloud local storage;
ru: **локальное зеркало Steam Cloud** -- содержимое локальной копии облачного хранилища клиента;

source: **Steam local game stats** -- Steam achievements database for offline use;
ru: **локальная игровая статистика** -- локальный дамп с файлами игровой статистики некоторых игр, допускающих её изменение в оффлайновом режиме;

source: **Steam music database** -- Steam Music database files;
ru: **база данных сервиса Steam Music** -- локальная база данных музыкального сервиса;

source: **Steam custom skins** -- all installed custom skins;
ru: **кастомные скины Steam** -- все установленные нестандартные обложки Steam;

source: troubleshooting:
ru: особые виды очистки:

source: **Steam updater cache** -- Steam updater cache with original downloaded files;
ru: **очистка обновлений Steam** -- локальный кэш с эталонными файлами клиента и различных модулей;

source: **Steam Guard cache** -- Steam authorization files.
ru: **очистка кэша Steam Guard** -- удаление файлов с токенами авторизации пользователей.
